// Сторінка адміністратора. 
// Ми використовуємо тут спеціальний колір, щоб підкреслити важливість зони.
export default function Admin() {
  return (
    <div className="text-center">
      {/* text-red-400 робить заголовок червоним, щоб відрізнити адмінку від звичайних сторінок. */}
      <h2 className="text-3xl font-bold text-red-400">Панель адміністратора ⚙️</h2>
      
      <p className="mt-4 text-slate-400">
        Доступ дозволено! Тут ви зможете додавати нові товари в магазин або видаляти старі.
      </p>
    </div>
  );
}