import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();

async function main() {
  // --- Етап 1: очищення бази ---
  //Видаляємо дані спочатку ті шов кінці і тка до верху, шоб не зламати зв'язок (Foreign Keys)
  // спочатку видаляю залежності таблиці розмір і кольори, потімтовари
  await prisma.productSize.deleteMany();
  await prisma.productColor.deleteMany();
  await prisma.product.deleteMany();
  console.log("Старе видалив, залив нового товару...");

  // ---Етап 2 створення стола ---
  const table = await prisma.product.create({
    data: {
      name: "Стіл 'Rodos light'",
      description: " Стиль та комфорт у кожній деталі ✨/nНаш стіл- трансформер не лише економить простір, а й створює атмосферу справжнього затишку./nЗасервірований, він готовий дивувати гостей своєю функціональністю та сучасним дизайном.🍽️/nСтіл, що підлаштовується під ваш настрій та компанію!💫/nВід романтичної вечері на двох до гучних зустрічей з друзями — цей стіл створений, щоб дарувати комфорт у будь- якій ситуації.🍷 ",
      category: "Столи",

      //створення кольорів, які будуть автоматчно підв'язані до цього стола через productId
      colors: {
        create: [
          // написати сюди цілу  тьому кольорів
          {
            name: "Акація австрійська", imageUrl: "/colors/Акація австрійська 0356.jpg"
          },
          {
            name: "Аліканте світлий", imageUrl: "/colors/Аліканте світлий 0509.jpg"
          },
          {
            name: "Аліканте темний", imageUrl: "/colors/Аліканте темний 0508.jpg"
          },
          {
            name: "Алюміній", imageUrl:"/colors/Алюміній 0079.jpg"
          },
          {
            name: "Аляска", imageUrl:"/colors/Алюміній 0079.jpg"
          },
          {
            name: "Ансберг сріблястий", imageUrl
          },
        ]
      }

    }
  })
  
}